Revit 2026 API

# ElectricalSystemPolesNumber Property

---

The Poles Number of the Electrical System.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int PolesNumber { get; }
```
```vb
Public ReadOnly Property PolesNumber As Integer
	Get
```
```cpp
public:
property int PolesNumber {
	int get ();
}
```
```fsharp
member PolesNumber : int with get
```

#### Property Value

Int32

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This property only available when System Type is Power! |

This property is used to retrieve the Poles Number of the Electrical System.

#### Reference

ElectricalSystem Class

Autodesk.Revit.DB.Electrical Namespace